Tekla Open API Reference for Tekla Structures 2025
ShapeItemEnumerator.Current Property
 Returns a shape item instance of the current element.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ShapeItem Current { get; }
Public ReadOnly Property Current As ShapeItem
	Get
Property Value
Type: ShapeItem
See Also
Reference
ShapeItemEnumerator Class
Tekla.Structures.Catalogs Namespace